[
	{ "wine": "Howell Mountain",
		"year": "2015",
    "tag": "howell",
		"author": "Antonio Galloni",
		"notes": "Made from yields of just one ton per acre, the 2015 Cabernet Sauvignon Howell Mountain is ripe, sensual and racy.  Unusually soft contours give the wine considerable appeal, even as a barrel sample at this early stage.  The flavors are dark and intense throughout."
	},
	{ "wine": "Howell Mountain",
		"year": "2014",
    "tag": "howell",
		"author": "Antonio Galloni",
		"notes": "Inky blue/purplish fruit, graphite, lavender, grilled herbs and smoke run through the 2014 Cabernet Sauvignon (Howell Mountain). The 2014 has all the Dunn signatures in its flavor profile, but in the mid-weight style of the year.  This is an especially restrained, young wine for Dunn with far less of the tannic heft that readers familiar with these wines are likely to expect."
	},
	{ "wine": "Napa Valley",
		"year": "2014",
    "tag": "napa",
		"author": "Antonio Galloni",
		"notes": "The 2014 Cabernet Sauvignon (Napa Valley) is an unusually soft wine from Dunn.  Aromatically expressive and nuanced, the 2014 offers plenty of immediacy, with attractive red cherry, plum, sweet tobacco, dried flowers and cedar nuances.  In 2014, the Napa Valley Cabernet is a blend of equal parts estate fruit and purchased grapes from a site in Coombsville.  In many years, the Napa Valley bottling has been a miniature of the Howell Mountain, but in 2014 it is more typical of a true appellation-level Cabernet meant for near to medium-term drinking."
	},
	{ "wine": "Howell Mountain",
		"year": "2013",
    "tag": "howell",
		"author": "",
		"notes": "The 2013 Cabernet Sauvignon Howell Mountain is a towering majestic wine. Rich, powerful and yet massively tannic, the 2013 possesses a stunning combination of super-ripe fruit, bright acids and plenty of supporting structure. In the early going, the Howell Mountain is a bit reticent, especially next to the Trailer, but after several hours, the vibrancy of the Howell Mountain bottling dazzles. Dunn's Howell Mountain Cabernet is without question one of the wines of the great 2013 vintage."
	},
	{ "wine": "Howell Mountain",
		"year": "2012",
    "tag": "howell",
		"author": "Antonio Galloni",
		"notes": "The 2012 Cabernet Sauvignon Howell Mountain is one of the most exotic, flamboyant young wines I have ever tasted from Randy and Mike Dunn. Graphite, cherry liqueur, smoke, licorice, plums and crème de cassis, open up in an alluring Cabernet Sauvignon that melds together ripeness and structure. The fruit is distinctly red-toned in 2012, with fewer of the darker notes that are often present in the Howell Cabernet. Pliant and expressive, but with plenty of underlying tannin, the 2012 is shaping up to be a beauty. Best of all, it won’t need decades in the cellar to start drinking well. (95+ points, Drinking Window 2020-2042, Tasted 10/2015)"
	},
	{
		"wine": "Howell Mountain &mdash; Trailer Vineyard",
		"year": "2012",
    "tag": "trailer",
		"author": "Antonio Galloni",
		"notes": "Dunn&#8217;s 2012 Cabernet Sauvignon Trailer Vineyard is a small bottling made from a historic vineyard that was once a central component of the Howell Mountain Cabernet from the early days up until when it was replanted following the 2013 harvest. Black fruit, smoke, plums, graphite, licorice and cloves are all super-expressive. The Trailer presents a demi-glace unctuosity, with building tannins and compelling personality. Unusually vivid for such a dark, explosive Cabernet, the 2012 Trailer is magnificent today. Licorice, cloves and violets meld into the deep, brooding finish. This is a tremendous example of Howell Mountain Cabernet Sauvignon. ( 96 points, Drinking Window 2022-2042, Tasted 10/2015)."
	},
	{
		"wine": "Napa Valley",
		"year": "2012",
    "tag": "napa",
		"author": "Antonio Galloni",
		"notes": "The 2012 Cabernet Sauvignon Napa Valley represents a bit of a departure for Dunn. Although not labeled as such, for the last few years, all of the fruit for the Napa bottling has come from estate vineyards on Howell Mountain that don’t make it into the flagship. In 2012, the Napa bottling is made mostly of purchased fruit from Coombsville (65%) and the rest fruit from Howell Mountain. I admit I have mixed feelings about this change, as the Napa has essentially been a ‘mini’ version of the Howell Cabernet that drinks well earlier than that wine. On the other hand, the 2012 Napa is probably more typical of what readers expect in an appellation wine, as it is open-knit, juicy and quite generous today, all qualities that are accentuated by the personality of the year. The flavors are bright and floral throughout, with plenty of sweet red berry and plum nuances. Readers should expect an unusually succulent Cabernet by Dunn standards, and a wine that will drink well right out of the gate. In just the one month that passed between my tastings of the bottled Dunn 2012s, the Napa Cabernet has come a long way.(92 points, Drinking Window 2017-2027, Tasted 10/2015."
	},
	{
		"wine": "Howell Mountain",
		"year": "2011",
    "tag": "howell",
		"author": "Antonio Galloni",
		"notes": "Dark red cherries, plums, menthol, tobacco, new leather and spices are some of the notes that inform the 2011 Cabernet Sauvignon Howell Mountain. Hints of lavender and licorice develop in the glass as the wine gradually opens up. In 2011, the Howell Mountain Cabernet offers plenty of depth and resonance, but the tannins are quite tamed by Dunn standards, making it a delicious wine to drink earlier than other recent vintages. ( 93+ points, Drinking Window 2018-2031, Tasted 12/2014)"
	},
	{
		"wine": "Napa Valley",
		"year": "2011",
    "tag": "napa",
		"author": "Antonio Galloni",
		"notes": "The 2011 Cabernet Sauvignon Napa Valley is one of the most open, young Dunn Cabernets I have ever tasted. Sweet red berries, cinnamon, wild flowers, cedar and tobacco are all laced together in a supple, racy Cabernet that is already drinking well. The 2011 is quite delicate today, almost uncharacteristically so. Once again, the Napa Valley Cabernet Sauvignon was made entirely from Howell Mountain fruit.( 92 points, Drinking Window 2014-2027, Tasted 12/2014)"
	},
	{
		"wine": "Howell Mountain",
		"year": "2010",
    "tag": "howell",
		"author": "Antonio Galloni",
		"notes": "There&#8217;s not much to say about Randy Dunn&#8217;s 2010 Cabernet Sauvignon Howell Mountain that I haven&#8217;t already said or written. A classic Howell Mountain Cabernet, the 2010 hits the palate with scents of graphite, pencil shavings, inky blue/purplish fruit, sage and spices, all backed up with swaths of broad yet impeccably balanced tannins. What a fascinating contrast it is to taste this next to David Abreu&#8217;s Thorevilos as we round out the evening. The Dunn is powerful, structured and incisive, with magnificent expression of site and fabulous overall balance. Dunn’s 2010 Cabernet Sauvignon Howell Mountain will go down as one of the great wines of this vintage. Readers have to be patient, but there is no question the 2010 is a real stunner. Knowing how hard it will be to wait, I expect the 2010 will start to open up around age ten. (98+ points, Drinking Window 2020–2040, Tasted-6/2015)"
	},
	{
		"wine": "Napa Valley",
		"year": "2010",
    "tag": "napa",
		"author": "Stephen Tanzer",
		"notes": "(13.9% alcohol): Bright, deep red. Wild, highly aromatic nose combines raspberry, blackberry, coffee, leather and mocha. Broad, ripe and dry, with peppery acidity and a deep spicy character lifting the dried cherry, dark berry and pipe tobacco flavors. Savory and claret-like cabernet with a very long finish featuring fine-grained tannins and subtle notes of leather, black cardamom, black tea and licorice. (92 points, Tasted-5/2014)"
	},
	{
		"wine": "Howell Mountain",
		"year": "2009",
    "tag": "howell",
		"author": "Antonio Galloni",
		"notes": "The 2009 Cabernet Sauvignon Howell Mountain has more energy and focus than the Napa Valley bottling. Iron, graphite, red fruits, dried flowers are some of the many notes that take shape in this deep, complex, powerful wine. I imagine the 2009 will still be spectacular at age 30. For now, it needs at least another handful of years of cellaring to drink well. Huge veins of minerality support the huge fruit, giving the wine much of its pure tension and vitality. This is going to be a fascinating wine to follow over the coming decades. (96+ points, Drinking Window 2019–2039, Tasted-12/2012)"
	},
	{
		"wine": "Napa Valley",
		"year": "2009",
    "tag": "napa",
		"author": "Antonio Galloni",
		"notes": "Dunn&#8217;s 2009 Cabernet Sauvignon Napa Valley is loaded with blue and black fruit, grilled herbs, asphalt, melted road tar and smoke. A dark, juicy wine, the 2009 is surprisingly open for a young Dunn Cabernet Sauvignon. In this vintage, Dunn&#8217;s Lake Vineyard, the last parcel on the property to ripen, accounts for nearly 50% of the blend. Anticipated maturity: 2014-2029. Randy Dunn&#8217;s two 2009s are quite different from each other in this vintage, something that isn&#8217;t always the case. That&#8217;s good news for Dunn fans, as the 2009 Napa Valley Cabernet Sauvignon is one of the estate&#8217;s few recent releases that won&#8217;t take ages to be accessible. (92 points, Drinking Window 2014-2029, Tasted 12/ 2012)"
	},
	{
		"wine": "Howell Mountain",
		"year": "2008",
    "tag": "howell",
		"author": "Antonio Galloni",
		"notes": "Randy Dunn’s 2008 Cabernet Sauvignon Howell Mountain has always bean a real beast. The product of a year in which a spring frost decimated production, the 2008 boasts massive fruit and overall intensity to the point the tannins are nearly buried. The flavors remain incredibly primary, with very little in the way of aromatic development, but, at the same time, I am happy to report readers will not have to wait another decade-plus to enjoy the 2008, as I had originally thought. Little by little Dunn&#8217;s 2008 Cabernet Sauvignon Howell Mountain is coming together. (98 points, tasted 1/2015) The 2008 Cabernet Sauvignon Howell Mountain takes things to another level, as hard as it may seem to believe. This was another difficult vintage for Dunn. Yields were down a full 50%. In exchange, nature rewarded Dunn with the fruit to make an epic wine that could very well turn out to be a modern-day legend. The 2008 is a huge, towering wine packed with dark fruit, licorice, tar, asphalt and licorice. Layers of perfume are woven throughout this majestic effort. The 2008 should only be purchased by the very patient, but it is a legendary wine in the making. (98+ points, tasted 1/2011)"
	},
	{
		"wine": "Napa Valley",
		"year": "2008",
    "tag": "napa",
		"author": "Antonio Galloni",
		"notes": "The 2008 Cabernet Sauvignon Napa Valley is simply extraordinary. Layers of dark fruit, flowers, licorice, spices and mint are beautifully woven together. With time in the glass the wine&#8217;s striking inner perfume takes center stage. Tar, smoke, flowers, red berries and licorice are some of the nuances that reappear on the finish, while gorgeous aromatics are laced throughout. I could go on. Let me make it simple: this is a flat-out great bottle of wine from Randy Dunn.&#8221;  (96 points, Drinking window 2018-2033, tasted 12/2011)"
	},
	{
		"wine": "Howell Mountain",
		"year": "2007",
    "tag": "howell",
		"author": "Antonio Galloni",
		"notes": "The 2007 Cabernet Sauvignon Howell Mountain is unlike any wine I have ever tasted from Dunn. Layer after layer of flavor saturates the palate in this opulent, full-throttle Cabernet Sauvignon. The 2007 possesses dazzling textural richness, depth and sheer intensity. Purists may prefer more structured vintages, but for a producer known for such slow maturing wines, the 2007 is a huge pleasure to taste.&#8221; (97 points, Drinking window 2017-2037, tasted 12/2011)"
	},
	{
		"wine": "Napa Valley",
		"year": "2007",
    "tag": "napa",
		"author": "Antonio Galloni",
		"notes": "The 2007 Cabernet Sauvignon Napa Valley is one of the very finest young wines I have ever tasted from Randy Dunn. Layers of dark red fruit, blackberries, flowers, mint and licorice emerge from this seamless, large-scaled wine. This is a classic, opulent 2007 that never abandons its traditional sense of structure. All of the aromas and flavors build beautifully towards the immensely rewarding, intense, seductive finish. This is a dazzling showing from Randy Dunn. The 2007 is atypically open right now.&#8221; (95 points, Drinking window 2014-2027, tasted 12/2011)"
	},
	{
		"wine": "Howell Mountain",
		"year": "2006",
    "tag": "howell",
		"author": "Antonio Galloni",
		"notes": "The 2006 Cabernet Sauvignon Howell Mountain is big, dark and juicy. There is an element of wildness that runs through the wine. Graphite, licorice, tar and smoke are just some of the nuances that add complexity. The 2006 boasts superb purity from start to finish. Elements of fleshiness give the impression the 2006 might drink well relatively early, until the massive tannins set in. Floral notes add freshness on the finish. This is another fabulous wine from Randy Dunn. (95 points, Drinking window 2016-2036, tasted 12/2011)"
	},
	{
		"wine": "Napa Valley",
		"year": "2006",
    "tag": "napa",
		"author": "Antonio Galloni",
		"notes": "The 2006 Cabernet Sauvignon Napa Valley is quite a bit richer than the 2005 tasted alongside it. The 2006 shows gorgeous depth as it opens up in the glass. Dark fruit, licorice, smoke and tar are some of the notes that flesh out in this broad-shouldered Cabernet Sauvignon. A creamy, textured finish rounds things out in style. (94 points, Drinking window 2013-2024, tasted 12/2011)"
	},
	{
		"wine": "Howell Mountain",
		"year": "2005",
    "tag": "howell",
		"author": "Antonio Galloni",
		"notes": "The 2005 Cabernet Sauvignon Howell Mountain is a huge, powerful wine that is starting to show the very earliest signs of development. An exotic mélange of smoke, tar, camphor and licorice leads to expressive, fleshy fruit as the 2005 opens up in the glass. Hints of tobacco, leather, licorice and spices are layered into the finish. This is a gorgeous wine with lovely mid-palate presence and fleshiness. (94 points, Drinking window 2017-2035, tasted 12/2011)"
	},
	{
		"wine": "Napa Valley",
		"year": "2005",
    "tag": "napa",
		"author": "Antonio Galloni",
		"notes": "The 2005 Cabernet Sauvignon Napa Valley is gorgeous. It is a soft, caressing wine laced with expressive dark fruit, blackberries, spices, leather and flowers, all of which come together beautifully in the glass. This is a surprisingly soft, open young wine with lovely inner perfume and a mid-weight structure that makes it approachable, even today. It is a great starting point for readers who are new to the Dunn wines. (92 points, Drinking window 2013-2021, tasted 12/2011)"
	},
	{
		"wine": "Howell Mountain",
		"year": "2004",
    "tag": "howell",
		"author": "Stephen Tanzer",
		"notes": "(14% alcohol): Bright, youthful medium ruby. Vibrant aromas of cassis, black raspberry, cherry pit and bitter chocolate are complicated by hints of leather and pipe tobacco. Very suave and fine-grained but youthfully withdrawn, with the dark berry, bitter cherry, licorice, chewing tobacco and leather flavors carrying through the palate. An intriguing suggestion of floral oils adds another dimension. Boasts wonderful finesse to its strong but talc-like tannins. (93+? points, drinking window 2018-2035, tasted 6/2015)"
	},
	{
		"wine": "Napa Valley",
		"year": "2004",
    "tag": "napa",
		"author": "Stephen Tanzer",
		"notes": "Bright ruby-red. Aromas of black cherry, currant, underbrush and sweet oak, with medicinal and roasted nuances. Supple and broad in the mouth, with flavors of dark fruits, mocha, chocolate and fresh herbs. I get the impression of a rather wide range of ripeness. (89 points, tasted 5/2008)"
	},
	{
		"wine": "Howell Mountain",
		"year": "2003",
    "tag": "howell",
		"author": "Stephen Tanzer",
		"notes": "Bright ruby. Very tight and high-pitched on the nose, hinting at cassis, minerals and graphite.Then lush, sweet and impressively concentrated, with densely packed flavors of kirsch, currant and minerals and noteworthy inner-palate energy. Finer-grained than the Napa bottling, with better integration of acids and tannins. Finishes sappy and very long, with a chewy, palate-staining texture.This has delivered on the promise it showed from barrel. (93 points, tasted 1/2007)"
	},
	{
		"wine": "Napa Valley",
		"year": "2003",
    "tag": "napa",
		"author": "Stephen Tanzer",
		"notes": "Good bright ruby. Rather inky aromas of cassis, iron filings, graphite, licorice root and minerals.Ripe flavors of dark berries, sassafras and minerals; not particularly sweet but more accessible today than the Howell Mountain bottling. Finishes with serious, slightly dry tannins and very good length. Bright ruby. Very tight and high-pitched on the nose, hinting at cassis, minerals and graphite.Then lush, sweet and impressively concentrated, with densely packed flavors of kirsch, currant and minerals and noteworthy inner-palate energy. Finer-grained than the Napa bottling, with better integration of acids and tannins. Finishes sappy and very long, with a chewy, palate-staining texture.This has delivered on the promise it showed from barrel. (90 points, tasted 1/2007)"
	},
	{
		"wine": "Howell Mountain",
		"year": "2002",
    "tag": "howell",
		"author": "Stephen Tanzer",
		"notes": "Bright, saturated ruby-red. Vibrant nose offers cassis, minerals, gunpowder and spices. Densely packed but nicely delineated, with primary, fruit-driven flavors of blackcurrant and spices. Very juicy and suave but still quite youthfully unevolved. Finishes with firm but smooth tannins. This calls for considerably more patience than the Napa Valley bottling, but even today there&#8217;s a pleasing pliancy of texture. This held up extremely well in the recorked bottle. (93 points, tasted 1/2006)"
	},
	{
		"wine": "Napa Valley",
		"year": "2002",
    "tag": "napa",
		"author": "Stephen Tanzer",
		"notes": "Full ruby-red. Aromas of cassis, graphite, mint and chocolate, plus a whiff of band-aid. Then surprisingly pliant and creamy for a Dunn cabernet, with accessible flavors of currant, licorice and milk chocolate. Finishes with rather suave tannins and some juicy acidity. Suppler than it appeared to be last spring when I tasted it from barrel, and considerably softer than the Howell Mountain bottling. (90 points, tasted 1/2006)"
	},
	{
		"wine": "Howell Mountain",
		"year": "2001",
    "tag": "howell",
		"author": "Stephen Tanzer",
		"notes": "Bright medium ruby. Enticing aromas of cassis, blackberry, leather and violet. Juicy, tightly coiled and penetrating, with the sharp delineation of the best examples from Howell Mountain Densely packed but closed in on itself. A very backward but extremely promising wine that finishes with broad, dusty, fine tannins and excellent length. Wait five years on the Napa cab, but give this at least seven or eight. An impressive return to form for Dunn following the cool, late harvests of 1998 through 2000, which were particularly tough on Howell Mountain. (93+ points, tasted 1/2005"
	},
	{
		"wine": "Napa Valley",
		"year": "2001",
    "tag": "napa",
		"author": "Stephen Tanzer",
		"notes": "Deep ruby-red. Vibrant aromas of cassis, black cherry, licorice and violet. Juicy, supple and sweet, with an intense cassis and tart red berry fruitiness complicated by cocoa powder, licorice, fresh herbs and tree bark. Bright acids give this highly concentrated, very pure cabernet a lovely light touch. Finishes with firm but suave tannins and excellent length. (93 points, tasted 1/2005)"
	},
	{
		"wine": "Howell Mountain",
		"year": "2000",
    "tag": "howell",
		"author": "Stephen Tanzer",
		"notes": "First component: Saturated ruby. Wild aromas of crushed dark berries, leather and meat. Juicy and minerally but not particularly fleshy. Shows a slightly rustic gamey quality to go with the mountain berry intensity. Second component: Distinctly animal on the nose. More expressive, expansive flavors of black raspberry, minerals and game. This may well surpass both the &#8217;99 and &#8217;98 Howell Mountain. (91-94 points, tasted 1/2003)"
	},
	{
		"wine": "Napa Valley",
		"year": "2000",
    "tag": "napa",
		"author": "Stephen Tanzer",
		"notes": "Medium ruby. Cassis, violet, minerals, game, espresso and smoke on the nose. Dense and rather suave; less concentrated than the Howell sample but easier to taste today. Hints of chocolate and menthol to go with the dark berry flavors. &#8220;Typical Napa Valley fruit,&#8221; notes Randy Dunn.(90-92 points, tasted 5/2002)"
	},
	{
		"wine": "Howell Mountain",
		"year": "1999",
    "tag": "howell",
		"author": "Antonio Galloni",
		"notes": "The tasting ends on a high note, as the 1999 Cabernet Sauvignon Howell Mountain is deeply expressive, despite its obvious youth. Here it is the wine&#8217;s sense of energy that stands out most. Vivid, nuanced and structured, the 1999 is a wine to cellar for another 5-10 years at a minimum to allow the flavors to flesh out. Readers lucky enough to own the 1999 who can wait a few years will be very happy. (95+ points, drinking window 2019-2039, tasted 2/2014)"
	},
	{
		"wine": "Napa Valley",
		"year": "1999",
    "tag": "napa",
		"author": "Stephen Tanzer",
		"notes": "Bright ruby-red. Wild aromas of blackberry, black cherry, espresso, leather, raw meat, tobacco and mint. Juicy, sweet and plump, with intense but rather rustic flavors. Finishes with lingering sweet fruit and surprisingly ripe tannins. Not squeaky-clean but long on personality. (90 points, tasted 1/2002)"
	},
	{
		"wine": "Howell Mountain",
		"year": "1998",
    "tag": "howell",
		"author": "Antonio Galloni",
		"notes": "Ironically, the 1998 Cabernet Sauvignon Howell Mountain from a much weaker vintage than 1997 on paper, is a much more interesting wine. Huge and explosive on the palate, the 1998 boasts serious depth and concentration. Iron, smoke, anise and dark red/blackish fruit all swirl around in the glass in a striking, nuanced Cabernet that is among the wines of the year in Napa Valley. If there is a dark horse in this tasting, the 1998 is it. Beautiful. (97 points, tasted 2/2014)"
	},
	{
		"wine": "Napa Valley",
		"year": "1998",
    "tag": "napa",
		"author": "Stephen Tanzer",
		"notes": "Bright ruby-red. Aromas of cassis, licorice, graphite and game. Dense, supple and rich in extract; juicy flavors of cassis and licorice. Offers impressive texture for the vintage, but comes across as distinctly less sweet than the Howell Mountain bottling. Finishes with very good length and ripe, fairly substantial tannins that grew slightly dry with aeration. (90 points, tasted 1/2001)"
	},
	{
		"wine": "Howell Mountain",
		"year": "1997",
    "tag": "howell",
		"author": "Antonio Galloni",
		"notes": "In this context, the 1997 Cabernet Sauvignon Howell Mountain is very pretty, but not quite at the level of the very best wines in this tasting, a tall order for sure. This is a texturally open and silky vintage for the Howell Mountain, with good balance and tons of near-term appeal. I like the 1997 for current and medium-term. drinking, but don&#8217;t see it making old bones, within the context of Dunn, of course. Red stone fruits, smoke, tobacco and licorice linger on the finish. (93 points, tasted 2/2014)"
	},
	{
		"wine": "Napa Valley",
		"year": "1997",
    "tag": "napa",
		"author": "Stephen Tanzer",
		"notes": "Saturated ruby. Brooding aromas of blueberry, blackberry, dark chocolate, licorice and meat; showed more sweetness with aeration. Juicy, intensely flavored and quite penetrating, with brisk flavors of crystallized black and red fruit firmed by strong acids. Rather folded in on itself today and not showing its density. Finishes with substantial but ripe tannins and sneaky sweetness. (89+ points, tasted 1/2000)"
	},
	{
		"wine": "Howell Mountain",
		"year": "1996",
    "tag": "howell",
		"author": "Antonio Galloni",
		"notes": "The 1996 Cabernet Sauvignon Howell Mountain is dark, brooding and intense to the core, with huge fruit, equally intense tannins and the stuffing to drink well for another 20 years. Next to some of the other wines in the lineup, the 1996 comes across as very ripe, but also quite tannic. My sense is that the overall balance isn&#8217;t up to the level of the best wines. I would be tempted to give the 1996 another year or two in the cellar. (93 points, tasted 2/2014)"
	},
	{
		"wine": "Napa Valley",
		"year": "1996",
    "tag": "napa",
		"author": "Stephen Tanzer",
		"notes": "Full ruby-red. Superripe aromas of currant, loam, smoke, roast coffee and tobacco. Lush and silky in texture but not yet showing its complexity due to an edge of acidity. More red than black fruit flavors. Doesn&#8217;t have quite the consistent ripeness of the &#8217;97, but the tannins are ripe and the flavors quite persistent. (91 points, tasted 5/2000)"
	},
	{
		"wine": "Howell Mountain",
		"year": "1995",
    "tag": "howell",
		"author": "Antonio Galloni",
		"notes": "A huge, tannic wine, the 1995 Cabernet Sauvignon Howell Mountain is the first wine in this tasting that is nowhere near close to deliver maximum pleasure. Layers of dark red/blackish fruit supported by firm, incisive tannin hit the palate in an explosive, full-bodied Cabernet built for the cellar. The 1995 is a beauty, but readers need to be very, very patient. (95+ points, drinking window 2020-2035, tasted 2/2014)"
	},
	{
		"wine": "Napa Valley",
		"year": "1995",
    "tag": "napa",
		"author": "Stephen Tanzer",
		"notes": "Dark ruby-red. Wild, perfumed aromas of cassis, blackberry, minerals, tobacco, iron and mocha. Juicy, very intensely flavored and sharply delineated, but tightly wound; flavors of raw dark berries and licorice in the middle palate. Strong framing acidity gives the fruit a juicy quality. Finishes firmly tannic and long, with the notes of mocha and iron repeating. (91+ points, tasted 11/1998)"
	},
	{
		"wine": "Howell Mountain",
		"year": "1994",
    "tag": "howell",
		"author": "Antonio Galloni",
		"notes": "A wine that takes over all the senses, Dunn&#8217;s 1994 Cabernet Sauvignon Howell Mountain is a drop-dead gorgeous beauty. New leather, smoke and spices are some of the many notes that develop in the glass, adding complexity and character. This is an especially powerful, brooding vintage for the Howell Mountain. All the elements fall into place effortlessly. The 1994 is rich, broad, ample and incredibly expressive today. What a wine. (97 points, drinking window 2014-2034, tasted 2/2014)"
	},
	{
		"wine": "Howell Mountain",
		"year": "1993",
    "tag": "howell",
		"author": "Antonio Galloni",
		"notes": "The 1993 Cabernet Sauvignon Howell Mountain is an excellent choice for drinking over the next decade or so, as it appears to be more of a mid-weight vintage for Dunn. Open and expressive today, the 1993 is a wine of balance and proportion. Sweet tobacco, anise and spice notes inform the close. (93 points, drinking window 2014-2034, tasted 2/2014)"
	},
	{
		"wine": "Howell Mountain",
		"year": "1992",
    "tag": "howell",
		"author": "Antonio Galloni",
		"notes": "The 1992 Cabernet Sauvignon Howell Mountain is simply stunning. Wow. The fruit is so vibrant, alive and expressive. A wine of extraordinary harmony, the 1992 flows across the palate with voluptuous fruit. Silky tannins give the 1992 a measure of textural finesse that is compelling. Rose petals, sweet red berries and flowers build to a deep, resonant finish that is striking for its purity and beauty. I have also had the 1992 Napa Valley Cabernet recently, confirming this is a great Dunn vintage all around. Readers holding the 1992 are in for a real treat"
	},
	{
		"wine": "Petit Sirah",
		"year": "1992",
    "tag": "petit",
		"author": "Antonio Galloni",
		"notes": "The 1992 Petit Sirah is absolutely striking. Iron, blood, smoke, tobacco and cedar wrap around a core of dark fruit in a powerful, wild wine bursting at the seams with personality. Now fully mature but showing no real signs of fading, the 1992 is in a perfect spot for readers who enjoy wines with tertiary nuances. The 1992 was made from Dunn’s Park Muscatine vineyard, the same site that informs Mike Dunn’s present-day Petites. It is fascinating to taste the 1992 for so many reasons. Apart from being exceedingly rare, is also seems to be more a wine of place rather than variety. In other words, terroir and microclimate dominate over more typical Petite flavors and textures. (93 points, drinking window 2014-2020, tasted 2/2014)"
	},
	{
		"wine": "Howell Mountain",
		"year": "1991",
    "tag": "howell",
		"author": "Antonio Galloni",
		"notes": "It all comes together in the 1991 Cabernet Sauvignon Howell Mountain. A huge, powerful wine, the 1991 is beautifully expressive today. An exotic melange of dark red/blackish fruit melds into smoke, incense and spices as the wine opens up. Air softens some of the contours nicely, making the 1991 hugely appealing today. This is a very pretty Cabernet Sauvignon to drink over the near and medium-term. (93 points, drinking window 2014-2024, tasted 2/2014)"
	},
	{
		"wine": "Howell Mountain",
		"year": "1990",
    "tag": "howell",
		"author": "Antonio Galloni",
		"notes": "The 1990 Cabernet Sauvignon Howell Mountain is rich, powerful and explosive. Initially a bit on the wild side, the 1990 needs time to fully open up, but when it does the fireworks start. Both deep and broad on the palate, the 1990 is a direct, voluptuous wine. Next to some of the other vintages, the 1990 is maybe a bit one-dimensional, but that dimension is nevertheless one of extreme beauty. The 1990 remains a bit monolithic. I wonder what time will bring here. (93+ points, drinking window 2014-2030, tasted 2/2014)"
	},
	{
		"wine": "Howell Mountain",
		"year": "1989",
    "tag": "howell",
		"author": "Antonio Galloni",
		"notes": "A wine of pure texture and sensuality, Dunn&#8217;s 1989 Cabernet Sauvignon Howell Mountain stands out for its exceptional overall balance and layered, silky personality. Veins of underlying minerality add brightness to a core of dark red fruit, crushed rocks, mint, flowers and spices. What a pretty wine this is. (94 points, drinking window 2014-2024, tasted 2/2014)"
	},
	{
		"wine": "Howell Mountain",
		"year": "1988",
    "tag": "howell",
		"author": "Antonio Galloni",
		"notes": "The 1988 Cabernet Sauvignon Howell Mountain is one of the many highlights in this tasting. Initially quite reticent, the 1988 turns positively explosive with time in the glass. What a pleasure it is to watch the 1988 develop over several hours. By the end of the night, the 1988 is positively electric. Smoke, black fruit and menthol inform the deep, powerful finish. (97 points, drinking window 2014-2020, tasted 2/2014)"
	},
	{
		"wine": "Howell Mountain",
		"year": "1987",
    "tag": "howell",
		"author": "Antonio Galloni",
		"notes": "One of the most gracious and polished wines in this tasting, the 1987 Cabernet Sauvignon Howell Mountain is laced with bright red berries, spices, licorice, tobacco and smoke. The flavors remain lively throughout, but the wine&#8217;s mid-weight structure suggests it is best enjoyed over the next 10-15 years. What a beautiful and unexpected surprise the 1987 has turned out to be. (96 points, drinking window 2014-2024, tasted 2/2014)"
	},
	{
		"wine": "Howell Mountain",
		"year": "1986",
    "tag": "howell",
		"author": "Antonio Galloni",
		"notes": "Tasted from magnum, the 1986 Cabernet Sauvignon Howell Mountain is also the most forward and resolved of these four wines. Crushed flowers, mint, dried cherry and spice notes are all laced together in an open-knit Cabernet that is peaking. The 1986 is a terrific choice for drinking now and over the next handful of years, as it is not especially age worthy…by Dunn standards. (93 points, drinking window 2015-2020, tasted 9/2015)"
	},
	{
		"wine": "Howell Mountain",
		"year": "1985",
    "tag": "howell",
		"author": "Antonio Galloni",
		"notes": "Dunn’s 1985 Cabernet Sauvignon Howell Mountain is a real bombshell. Dark, sensual and beautifully layered in the glass, the 1985 is one of the more voluptuous Dunn Cabernets of this era. Graphite, smoke, licorice and graphite add nuance, while silky tannins add to an overall impression of finesse. This is another dazzling wine from Randy Dunn. The 1985 will continue to provide thrilling drinking for another two decades. The 1985 rarely fails to deliver. On this night, it is pure magic. (96+ points, drinking window 2015-2035, tasted 9/2015)"
	},
	{
		"wine": "Howell Mountain",
		"year": "1984",
    "tag": "howell",
		"author": "Antonio Galloni",
		"notes": "Sadly, the 1984 Cabernet Sauvignon Howell Mountain isn&#8217;t perfect. One bottle is corked. A second bottle is moldy in its bouquet, but a bit better on the palate, which only heightens the frustration, as there seems to be good depth and nuance below the troubled aromatics. (88? points, drinking window 2014-2020, tasted 2/2014)"
	},
	{
		"wine": "Howell Mountain",
		"year": "1983",
    "tag": "howell",
		"author": "Antonio Galloni",
		"notes": "The 1983 Cabernet Sauvignon Howell Mountain is one of the softest, most inviting wines in this tasting. Here it is the wine&#8217;s pure texture and layers of fruit that stand out most. Leather, menthol and smoke all add nuance on the close as the wine continues to come together with time in the glass. Among Dunn&#8217;s early wines, the 1983 is one of the vintages that is closest to maturity, although it will drink well for at least another handful of years. Today, the 1983 is a wine to enjoy for its soft contours and supple, inviting personality. (93 points, drinking window 2014-2020, tasted 2/2014)"
	},
	{
		"wine": "Howell Mountain",
		"year": "1982",
    "tag": "howell",
		"author": "Antonio Galloni",
		"notes": "Things get back on track quickly with the 1982 Cabernet Sauvignon Howell Mountain. Utterly magnificent in the glass, the 1982 graces the palate with a host of distinctly ferrous notes, followed by the essence of red cherry, smoke and underbrush. The 1982 is explosive, structured and intense from the very first taste. It is another wine that is simply dazzling tonight. In a word: superb. (96 points, drinking window 2014-2024, tasted 2/2014)"
	},
	{
		"wine": "Howell Mountain",
		"year": "1981",
    "tag": "howell",
		"author": "Antonio Galloni",
		"notes": "Sadly, we have back luck with the 1981 Cabernet Sauvignon Howell Mountain Both bottles are corked. (? points, tasted 2/2014)"
	},
	{
		"wine": "Howell Mountain",
		"year": "1980",
    "tag": "howell",
		"author": "Antonio Galloni",
		"notes": "A deep, expressive wine, the 1980 Cabernet Sauvignon Howell Mountain comes across as though it could still use more time to soften! Sweet black cherries, plums, crème de cassis, smoke and sweet herbs meld together in a powerful, intense wine with enough freshness to drink well for another healthy 10-15 years, perhaps longer. The 1980 only suffers in comparison to some of the other bottles on the table. Nevertheless, this is a terrific showing. (94 points, drinking window 2015-2025, 9/2015)"
	},
	{
		"wine": "Howell Mountain",
		"year": "1979",
    "tag": "howell",
		"author": "Antonio Galloni",
		"notes": "Randy Dunn got off to an auspicious start with his 1979 Cabernet Sauvignon Howell Mountain, a wine that remains magnificent today. This is an especially fine bottle, and quite a bit more impressive than the bottle I had about a year ago. Sinewy and explosive in the glass, the 1979 hits the palate with a rush of tobacco, crushed flowers, lavender, graphite and smoke. The 1979 is a wine of contrasts; at times delicate, in other moments more powerful. Raw, wild and intense, the 1979 captures a magical and innocent era in the history of Napa Valley. Readers lucky enough to own the 1979 are in for a real treat. It is one of the most hauntingly beautiful Napa Valley Cabernets I have ever tasted. (97 points, drinking window 2015-2025, tasted 9/2015)"
	}
]


