[{
		"year": 1975,
		"story": "Randy is hired by Caymus as the Enologist."
	},
	{
		"year": 1978,
		"story": "Randy and Lori purchase the “Trailer Vineyard” and begin farming 5 ½ acres of Cabernet in their free time and on the weekends. Jenny is born and the family moves into the white house."
	},
	{
		"year": 1979,
		"story": "Randy harvests 9 tons of Cabernet Sauvignon from his vineyard and the Fank Vineyard. He purchases 3 tons from the Beatty vineyard and produces 660 cases of 750ml’s, 28 cases of magnums and 53 five liter bottles, Dunn Vineyards begins…",
		"quote": "I knew that I wanted to simplify things after my experience at Caymus. I didn’t want to be bottling into the back of a super market truck and didn’t want to be subjugated to the marketing department’s demands. Keep it simple dummy."
	},
	{
		"year": 1981,
		"story": "The winery is bonded, here in Angwin.",
		"story2": "Randy and Lori’s second daughter Kristina is born."
	},
	{
		"year": 1982,
		"story": "[[ NEEDS EDITING ]] (pic of 5L box) made by hand from a fallen Ponderosa Pine. Randy assists the Lamborn Family with their first wine, consults on Bill Smith’s La Jota project with Helen Turley.",
		"story2": "The 5L boxes were hand made here at the winery from a fallen Ponderosa Pine. Randy makes the first Lamborn Family wine. Randy consults on Bill Smith’s revived La Jota wine with Helen Turley."
	},
	{
		"year": 1983,
		"story": "Randy makes the first Grace Family wine at the Caymus winery."
	},
	{
		"year": 1984,
		"story": "The ATF approves Howell Mountain AVA in January. The ’81 vintage is bottled and the 5L’s received etched bottles for the first time. Randy made the Livingston – Moffett wine."
	},
	{
		"year": 1985,
		"story": "Randy parts way with Caymus. Construction begins on the brown house. "
	},
	{
		"year": 1986,
		"story": "The family moves into the brown house. Randy makes the first Pahlmeyer wine after offering to buy Jayson’s {{ ? }} fruit."
	},
	{
		"year": 1987,
		"story": "Raul Martinez is brought on to assist Randy in the vineyard. He was the first employee and is still our vineyard manager to this day."
	},
	{
		"year": 1988,
		"story": "Mike graduates from UC Santa Barbara"
	},
	{
		"year": 1989,
		"story": "The caves are dug. Dunn has more space to store its barrels and Jenny and Kristina get a roller rink!"
	},
	{
		"year": 1991,
		"story": "Mike marries Kara Pecota. Randy purchases the Park Muscatine Vineyard."
	},
	{
		"year": 1994,
		"story": "Mike and Kara bring their first son and the first grandchild into the family as Alex is born."
	},
	{
		"year": 1995,
		"story": "Erin Begerow joins the team and takes over the office management and mailing list coordination."
	},
	{
		"year": 1996,
		"story": "Jennifer graduates HS."
	},
	{
		"year": 1997,
		"story": "Mike and Kara have a baby girl, the first granddaughter. Tatyana is born."
	},
	{
		"year": 1999,
		"story": "Mike returns to the winery, working 3 days a week. Kristina graduates from High School. We have our biggest set back ever as Jennifer passes away."
	},
	{
		"year": 2001,
		"story": "Randy makes the first vintage of the Palmaz wine here, as they construct their facility. Lori passes her exam and becomes a Master Gardener. Planted the Lake Vineyard and purchased the New Hearth property {{ ? }}.",
		"story2": "Adan Salgado is hired on full time to assist in the vineyard not only is he still a part of the team, but is responsible for waxing the Howell Mountain wine every vintage (100 cases a day)."
	},
	{
		"year": 2003,
		"story": "Randy makes the first vintage of Feather for the Long Shadows project in the Columbia Valley of Washington.",
    "story2": "Mike buys the old vine Petite Sirah from Randy’s Park Muscatine Vineyard and starts the <a href=\"retrocellars.com\" class=\"link dim dark-blue\">Retro Cellars label</a> with Kara."
	},
	{
		"year": 2004,
		"story": "Mike sells the bike shop and renovations begin on the white house (office). The Sentinel Hill is purchased and the development rights are gifted to the Napa Valley Land Trust."
	},
	{
		"year": 2005,
		"story": "Kristina graduates from Cal Poly. Hers is the first class of their Wine and Viticulture program.",
		"story2": "Rosalio Olivera is hired full time to assist in the vineyard and remains a valuable member of the team today."
	},
	{
		"year": 2006,
		"story": "Kristina comes to work full time at the winery.",
    "story2": "Randy and Lori purchase the Wildlake Property and donate it to the Napa Valley Land Trust.",
		"story3": "Marcos Olivera joins us full time. He is the back bone of the vineyard crew and if Raul ever retires most certainly will take his place."
	},
	{
		"year": 2008,
		"story": "Four continuous days of 19&deg; lows cut our harvest in half for the year."
	},
	{
		"year": 2010,
		"story": "Kristina marrie Brian Buchanan."
	},
	{
		"year": 2011,
		"story": "Our latest harvest ever: we didn't start picking grapes until October 29th."
	},
	{
		"year": 2011,
		"story": "SFGate Publish <a class=\"link dark-blue dim\" target=\"_blank\" href=\"http://www.sfgate.com/wine/thirst/article/Randy-Dunn-s-Cabernet-crusade-3813953.php\">\"Randy Dunn's Cabernet Crusade\"</a>."
	},
	{
		"year": 2013,
		"story": "Kristina and Brian welcome their first daughter, Taylor, into the world"
	},
	{
		"year": 2014,
		"story": "Adriaan Foote joins the team as Mike’s assistant in the cellar"
	},
	{
		"year": 2015,
		"story": "Ashlyn, Kristina and Brian’s second daughter is born.",
		"story2": "Fernando Olivera Hernandez is hired full time with us.",
		"story3": "Jay McInerney pays a visit to the winery and <a class=\"link dark-blue dim\" target=\"_blank\" href=\"http://www.townandcountrymag.com/leisure/drinks/a4256/jay-mcinerney-june-july-2014/\"> writes about it</a>."
	},
	{
		"year": 2016,
		"story": "Ben Hiza comes up to assist Mike with bottling the 2013’s and is now assisting with the national distribution, tours and whatever else needs doing."
	},
	{
		"year": "The Future",
		"story": "<i>We have no intentions of increasing our production or growing the brand. The current size of our farm and its production allows us to be involved in all aspects. If it were any bigger the work would become much more administrative, managerial not to mention the amount of effort to sell the wine would increase exponentially and for us that’s not the fun part.</i>"
	}
]
